server/app/controllers/characters_controller.rb

SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def index
    @characters = Character.all.where("user_id = ?", params[:user_id])

INSERT INTO "characters" ("user_id", "name", "role", "exp", "level", "max_health", "max_mana", "current_health", "current_mana", "items", "map", "pos_x", "pos_y", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @character = Character.new(character_params)
    if @character.save

SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "characters" SET "current_health" = ?, "map" = ?, "pos_x" = ?, "pos_y" = ?, "updated_at" = ? WHERE "characters"."id" = ?  [["current_health", 85], ["map", 10201], ["pos_x", 14], ["pos_y", 416], ["updated_at", "2022-12-09 07:12:36.713607"], ["id", 1]]
---
  def save_pos
    @character = Character.find(params[:character][:id])
    @character.update(location_params)

DELETE FROM "characters" WHERE "characters"."id" = ?  [["id", 3]]
SELECT "characters".* FROM "characters"
---
  def destroy
    @character.destroy
    @characters = Character.all

SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def set_character
    @character = Character.find(params[:id])