server/app/controllers/items_controller.rb

SELECT "items".* FROM "items" WHERE (character_id = '14')
---
  def index
    @items = Item.all.where("character_id = ?", params[:character_id])