server/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "Pollito"], ["email", "blazza1@hotmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2022-12-02 16:08:17.386012"], ["updated_at", "2022-12-02 16:08:17.386012"]]

  def admin
    @user = User.find(params[:user][:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]