server/app/models/character.rb

  def item_count
    self.items.all.count { |item| item.slot.to_i.to_s == item.slot && item.slot.to_i > 0 && item.slot.to_i <= 50 }
---
SELECT "items".* FROM "items" WHERE "items"."character_id" = ?  [["character_id", 14]]