server/app/models/item.rb

  def check_slot
    return if !character || slot.to_i.to_s != slot
    errors.add(:slot, "That slot is already taken") if character.items.all.any? { |item| item.slot == slot && item.id != id}
---
SELECT "items".* FROM "items" WHERE "items"."character_id" = ?  [["character_id", 14]]

  def stack_item
    return if !character
    return check_item_count if quantity.to_i < 1
    other_item = character.items.all.find { |item| item.name == name && item.id != id } # && item.updated_at != nil && item.updated_at < self.updated_at }
    # binding.pry
    return check_item_count if !other_item
    other_item.quantity = other_item.quantity.to_i + quantity
    other_item.save(validate: false)
---
SELECT "items".* FROM "items" WHERE "items"."character_id" = ?  [["character_id", 14]]
UPDATE "items" SET "quantity" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["quantity", 200], ["updated_at", "2022-12-05 14:03:08.240693"], ["id", 2]]